// За рейтингового системою оцінка визначається таким чином : якщо сумарний бал учня
// становить не менше 92 % від максимального, то виставляється оцінка 12, якщо не нижче 70
// %, то виставляється 8, якщо ж не нижче 50 %, то оцінка 5, в інших випадках — оцінка 2.
// Визначте оцінку учня, якщо він набрав N балів, а максимальне значення сумарного балу
// становить S.

#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_CTYPE, "ukr");

	int S = 100, N;
	do {
		cout << "Введіть ваш бал(від 0 до 100):";
		cin >> N;
	} while (N > 100 || N <= 0);

	if (N >= S / 100 * 92) {
		cout << "Ваш бал 12";
 }
	else if (N < S / 100 * 92 && N >= S / 100 * 70) {
		cout << "Ваш бал 8";
	}
	else if (N < S / 100 * 70 && N >= S / 100 * 50) {
		cout << "Ваш бал 5";
	}
	else cout << "Ваш бал 2";
}
