#include <iostream>

using namespace std;

int main()
{
    setlocale(0, "");
    float P1, P2, P3;
    do {
        cout << "Лiчильник пiсля першого пасажира: ";
        cin >> P1;
        if (P1 <= 0) cout << "Число не може бути менше або дорiвнювати 0" << endl;

    } while (P1 <= 0);
    cout << "Перший пасажир заплатив: " << P1 << " грн." << endl;
    cout << endl;

    do {
        cout << "Лiчильник пiсля другого пасажира: ";
        cin >> P2;
        if (P2 <= P1) cout << "Другий пасажир вийшов пiзнiше першого! Сума повинна бути бiльшою за " << P1 << " грн." << endl;


    } while (P2 <= P1);
    cout << "Другий пасажир заплатив: " << P2 << " грн." << endl;
    cout << endl;

    do {
        cout << "Лiчильник пiсля третього пасажира: ";
        cin >> P3;
        if (P3 <= P2) cout << "Третій пасажир вийшов пiзнiше першого i другого! Сума повинна бути бiльшою за " << P2 << " грн." << endl;

    } while (P3 <= P2);
    cout << "Третiй пасажир заплатив: " << P3 << " грн." << endl;
}